# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
#
# *Пример:*
#
# 5
#     1 2 3 4 5
#     3
#     -> 1

import random as rand


print("Введите число элементов массива: ",end=" ")
n = int(input())
arr = list()
for i in range(1,n+1):
    arr.append(i)
print(arr)
print("Введите элемент массива:",end=" ")
x = int(input())
print(f'Переменная {x} содержится в массиве {arr.count(x)} раз(а)')

