# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
#
# *Пример:*
#
# 5
#     1 2 3 4 5
#     6
#     -> 5
import math as m

print("Введите число элементов массива: ",end=" ")
n = int(input())
arr = list()
for i in range(1,n+1):
    arr.append(i)
print(arr)
print("Введите элемент массива X:",end=" ")
x = int(input())
if arr.count(x)!=0: print(f'Самое близкое число {x}')
elif x>n: print(f'Самое близкое число {n}')
elif x<1: print(f'Самое близкое число {1}')


